БухЭксп/Documents/CW_ПроектыДТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ПроектыДТ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CW_ДТГрузоперевозок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Импортер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектПоЗаказу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыПроектовДТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойРасчетДТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_РасчетыДТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Грузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДТГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДТГрузоперевозок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсегоРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НетарифкаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БрокерскиеУслугиРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПошлинаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СезСпецПошлинаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АнтидемпинговаяПошлинаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПроектДТ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ПроектыДТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетДТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_РасчетыДТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Documents/CW_ПроектыДТ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(ОсновнойРасчетДТ) Тогда
		Движения.CW_ДТГрузоперевозок.Очистить();
		//Сообщить("Не указан основной расчет ДТ!");
		//Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Аналитика) Тогда
		Движения.CW_ДТГрузоперевозок.Очистить();
		//Сообщить("Не заполнена аналитика проекта!");
		//Отказ = Истина;
		Возврат;
	КонецЕсли; 

	ТаблицаДляРаспределения = ПолучитьТаблицуДляРаспределения();
	ТаблицаДокумента        = Грузоперевозки.Выгрузить();
	ТаблицаДвижений         = Движения.CW_ДТГрузоперевозок.ВыгрузитьКолонки();
	
	Если Не ТаблицаДляРаспределения.Количество() Тогда
		Движения.CW_ДТГрузоперевозок.Очистить();
		//Сообщить("Не заполнена таблица <Распределение>!");
		//Отказ = Истина;
		Возврат;
	КонецЕсли; 

	
	ТаможенныйСборРуб   = ОсновнойРасчетДТ.ТаможенныйСборРуб;
	БрокерскиеУслугиРуб = ОсновнойРасчетДТ.БрокерскиеУслугиРуб;
	
	Для каждого Строка Из ТаблицаДляРаспределения Цикл
		
		Отбор = Новый Структура("КодТНВЭД, Номенклатура, ЕдиницаИзмерения");
		ЗаполнитьЗначенияСвойств(Отбор, Строка);
		ТаблицаПоОтбору = ТаблицаДокумента.Скопировать(Отбор);
		
		КоличествоРаспределено = ТаблицаПоОтбору.Итог("Количество");
		КоличествоВсего        = Строка.Количество;
		
		//КоличествоОсталосьРаспределить = КоличествоВсего - КоличествоРаспределено;
		
		//Если КоличествоОсталосьРаспределить > 0 Тогда
		//	ТекстСообщения = "По номенклатуре " + Строка.Номенклатура + " (код ТНВЭД: " + Строка.КодТНВЭД + ")" 
		//	+ " осталось не распределенное количество: " + КоличествоОсталосьРаспределить + " " + Строка.ЕдиницаИзмерения;  
		//	Сообщить(ТекстСообщения, СтатусСообщения.Важное); 
		//	Отказ = Истина;
		//	Продолжить; // Ставим оператор "Продолжить", а не "Прервать", таким образом, даем пользователя информацию об ошибках по всем строкам
		//КонецЕсли; 
		//
		//Если КоличествоРаспределено > КоличествоВсего Тогда
		//	ТекстСообщения = "По номенклатуре " + Строка.Номенклатура + " (код ТНВЭД: " + Строка.КодТНВЭД + ")" 
		//	+ "  распределенное количество превышает количество всего";  
		//	Сообщить(ТекстСообщения, СтатусСообщения.Важное); 
		//	Отказ = Истина;
		//	Продолжить; // Ставим оператор "Продолжить", а не "Прервать", таким образом, даем пользователя информацию об ошибках по всем строкам
		//КонецЕсли; 
		
		Если НЕ КоличествоВсего = КоличествоРаспределено Тогда
			ТекстСообщения = "Количество " + КоличествоВсего + " для товара " + СокрЛП(Строка.Номенклатура) + " , указанное" 
			+ " в расчете не соответствует количеству, распределенному на грузоперевозки " + КоличествоРаспределено;  
			Сообщить(ТекстСообщения, СтатусСообщения.Важное); 
			Отказ = Истина;
			Продолжить; // Ставим оператор "Продолжить", а не "Прервать", таким образом, даем пользователя информацию об ошибках по всем строкам
		КонецЕсли; 
		
		Коэфф = Строка.Количество / ТаблицаДляРаспределения.Итог("Количество");
		ТаможенныйСборРубПоСтроке   = Окр(ТаможенныйСборРуб * Коэфф,2);
		БрокерскиеУслугиРубПоСтроке = Окр(БрокерскиеУслугиРуб * Коэфф,2);
		
		ВсегоРубОсталосьРаспределить                  = Строка.ВсегоРуб + ТаможенныйСборРубПоСтроке;
		БрокерскиеУслугиРубОсталосьРаспределить       = БрокерскиеУслугиРубПоСтроке;
		НетарифкаРубОсталосьРаспределить              = Строка.НетарифкаРуб;
		ПошлинаРубОсталосьРаспределить                = Строка.ПошлинаРуб;
		СезСпецПошлинаРубОсталосьРаспределить         = Строка.СезСпецПошлинаРуб;
		АнтидемпинговаяПошлинаРубОсталосьРаспределить = Строка.АнтидемпинговаяПошлинаРуб;
		НДСРубОсталосьРаспределить                    = Строка.НДСРуб;
		
		КоличествоРаспределено = 0;
		Для каждого СтрокаОтбора Из ТаблицаПоОтбору Цикл
			
			Если СтрокаОтбора.Количество = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			Коэфф = СтрокаОтбора.Количество / КоличествоВсего;
			НоваяСтрока = ТаблицаДвижений.Добавить();
			
			НоваяСтрока.Регистратор = Ссылка;
			НоваяСтрока.ПроектДТ    = Ссылка;
			НоваяСтрока.РасчетДТ    = ОсновнойРасчетДТ;
			НоваяСтрока.Активность  = Истина;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОтбора);
			
			НоваяСтрока.ВсегоРуб                  = Окр(Строка.ВсегоРуб * Коэфф,2);
			НоваяСтрока.НетарифкаРуб              = Окр(Строка.НетарифкаРуб * Коэфф,2);
			НоваяСтрока.БрокерскиеУслугиРуб       = Окр(БрокерскиеУслугиРубПоСтроке * Коэфф,2);
			НоваяСтрока.ПошлинаРуб                = Окр(Строка.ПошлинаРуб * Коэфф,2);
			НоваяСтрока.СезСпецПошлинаРуб         = Окр(Строка.СезСпецПошлинаРуб * Коэфф,2);
			НоваяСтрока.АнтидемпинговаяПошлинаРуб = Окр(Строка.АнтидемпинговаяПошлинаРуб * Коэфф,2);
			НоваяСтрока.НДСРуб                    = Окр(Строка.НДСРуб * Коэфф,2);
			
			ВсегоРубОсталосьРаспределить                  = ВсегоРубОсталосьРаспределить - НоваяСтрока.ВсегоРуб;
			НетарифкаРубОсталосьРаспределить              = НетарифкаРубОсталосьРаспределить - НоваяСтрока.НетарифкаРуб;
			БрокерскиеУслугиРубОсталосьРаспределить       = БрокерскиеУслугиРубОсталосьРаспределить - НоваяСтрока.БрокерскиеУслугиРуб;
			ПошлинаРубОсталосьРаспределить                = ПошлинаРубОсталосьРаспределить - НоваяСтрока.ПошлинаРуб;
			СезСпецПошлинаРубОсталосьРаспределить         = СезСпецПошлинаРубОсталосьРаспределить - НоваяСтрока.СезСпецПошлинаРуб;
			АнтидемпинговаяПошлинаРубОсталосьРаспределить = АнтидемпинговаяПошлинаРубОсталосьРаспределить - НоваяСтрока.АнтидемпинговаяПошлинаРуб;
			НДСРубОсталосьРаспределить                    = НДСРубОсталосьРаспределить - НоваяСтрока.НДСРуб;
			
		КонецЦикла; 
		
		// Если остались нераспределенные остатки (погрешность округления), то унесем их в последнюю запись
		Если ТаблицаДвижений.Количество() Тогда
			
			ПоследняяСтрока = ТаблицаДвижений.Получить(ТаблицаДвижений.Количество() - 1);
			
			Если Не ВсегоРубОсталосьРаспределить = 0 Тогда
				ПоследняяСтрока.ВсегоРуб = ПоследняяСтрока.ВсегоРуб + ВсегоРубОсталосьРаспределить;
			КонецЕсли;
			
			Если Не НетарифкаРубОсталосьРаспределить = 0 Тогда
				ПоследняяСтрока.НетарифкаРуб = ПоследняяСтрока.НетарифкаРуб + НетарифкаРубОсталосьРаспределить;
			КонецЕсли;
			
			Если Не БрокерскиеУслугиРубОсталосьРаспределить = 0 Тогда
				ПоследняяСтрока.БрокерскиеУслугиРуб = ПоследняяСтрока.БрокерскиеУслугиРуб + БрокерскиеУслугиРубОсталосьРаспределить;
			КонецЕсли;
			
			Если Не ПошлинаРубОсталосьРаспределить = 0 Тогда
				ПоследняяСтрока.ПошлинаРуб = ПоследняяСтрока.ПошлинаРуб + ПошлинаРубОсталосьРаспределить;
			КонецЕсли;
			
			Если Не СезСпецПошлинаРубОсталосьРаспределить = 0 Тогда
				ПоследняяСтрока.СезСпецПошлинаРуб = ПоследняяСтрока.СезСпецПошлинаРуб + СезСпецПошлинаРубОсталосьРаспределить;
			КонецЕсли;
			
			Если Не АнтидемпинговаяПошлинаРубОсталосьРаспределить = 0 Тогда
				ПоследняяСтрока.АнтидемпинговаяПошлинаРуб = ПоследняяСтрока.АнтидемпинговаяПошлинаРуб + АнтидемпинговаяПошлинаРубОсталосьРаспределить;
			КонецЕсли;
			
			Если Не НДСРубОсталосьРаспределить = 0 Тогда
				ПоследняяСтрока.НДСРуб = ПоследняяСтрока.НДСРуб + НДСРубОсталосьРаспределить;
			КонецЕсли;
			
		КонецЕсли; 

	КонецЦикла; 
		
	Движения.CW_ДТГрузоперевозок.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры

Функция ПолучитьТаблицуДляРаспределения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РасчетСсылка", ОсновнойРасчетДТ);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CW_РасчетыДТТовары.Ссылка,
	|	CW_РасчетыДТТовары.КодТНВЭД,
	|	CW_РасчетыДТТовары.Номенклатура,
	|	CW_РасчетыДТТовары.ЕдиницаИзмерения,
	|	СУММА(CW_РасчетыДТТовары.Количество) КАК Количество,
	|	СУММА(CW_РасчетыДТТовары.ВсегоРуб) КАК ВсегоРуб,
	|	СУММА(CW_РасчетыДТТовары.НетарифкаРуб) КАК НетарифкаРуб,
	|	СУММА(CW_РасчетыДТТовары.ПошлинаРуб) КАК ПошлинаРуб,
	|	СУММА(CW_РасчетыДТТовары.СезСпецПошлинаРуб) КАК СезСпецПошлинаРуб,
	|	СУММА(CW_РасчетыДТТовары.АнтидемпинговаяПошлинаРуб) КАК АнтидемпинговаяПошлинаРуб,
	|	СУММА(CW_РасчетыДТТовары.НДСРуб) КАК НДСРуб
	|ИЗ
	|	Справочник.CW_РасчетыДТ.Товары КАК CW_РасчетыДТТовары
	|ГДЕ
	|	CW_РасчетыДТТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И CW_РасчетыДТТовары.Ссылка = &РасчетСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_РасчетыДТТовары.КодТНВЭД,
	|	CW_РасчетыДТТовары.Номенклатура,
	|	CW_РасчетыДТТовары.ЕдиницаИзмерения,
	|	CW_РасчетыДТТовары.Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
 
#КонецЕсли
